https://towardsdatascience.com/top-3-pandas-functions-i-wish-i-knew-earlier-6711030bf48a

In [3]:
import pandas as pd
df = pd.DataFrame(data={
   'Number': range(1, 1000000)
})

C:\Users\biegertm\AppData\Roaming\Python\Python39\site-packages\pandas\core\computation\expressions.py:21: UserWarning: Pandas requires version '2.8.0' or newer of 'numexpr' (version '2.7.3' currently installed).
  from pandas.core.computation.check import NUMEXPR_INSTALLED
C:\Users\biegertm\AppData\Roaming\Python\Python39\site-packages\pandas\core\arrays\masked.py:62: UserWarning: Pandas requires version '1.3.4' or newer of 'bottleneck' (version '1.3.2' currently installed).
  from pandas.core import (

In [4]:
%%time
total = 0
for _, row in df.iterrows():
    total += row['Number']
 
total

Wall time: 51.7 s

499999500000

In [5]:
%%time
total = 0
for row in df.itertuples(index=False):
    total += row.Number
 
total

Wall time: 719 ms

499999500000

In [7]:
df = pd.DataFrame(data={
    'Name': ['Bob', 'Mark', 'Josh', 'Anna', 'Peter', 'Dexter'],
    'Points': [37, 91, 66, 42, 99, 81]
})
df

     Name  Points
0     Bob      37
1    Mark      91
2    Josh      66
3    Anna      42
4   Peter      99
5  Dexter      81

In [8]:
df['Points'].nlargest(3)

4    99
1    91
5    81
Name: Points, dtype: int64

In [9]:
df.nlargest(3, columns='Points')

     Name  Points
4   Peter      99
1    Mark      91
5  Dexter      81

In [10]:
df.nsmallest(3, columns='Points')

   Name  Points
0   Bob      37
3  Anna      42
2  Josh      66

In [12]:
df = pd.DataFrame(data={
    'Name': ['Bob', 'Mark', 'Josh', 'Anna', 'Peter', 'Dexter'],
    'Points': [37, 91, 66, 42, 99, 81]
})
df

     Name  Points
0     Bob      37
1    Mark      91
2    Josh      66
3    Anna      42
4   Peter      99
5  Dexter      81

In [13]:
pd.cut(df['Points'], bins=2)

0    (36.938, 68.0]
1      (68.0, 99.0]
2    (36.938, 68.0]
3    (36.938, 68.0]
4      (68.0, 99.0]
5      (68.0, 99.0]
Name: Points, dtype: category
Categories (2, interval[float64, right]): [(36.938, 68.0] < (68.0, 99.0]]

In [14]:
pd.cut(df['Points'], bins=[0, 50, 100])

0      (0, 50]
1    (50, 100]
2    (50, 100]
3      (0, 50]
4    (50, 100]
5    (50, 100]
Name: Points, dtype: category
Categories (2, interval[int64, right]): [(0, 50] < (50, 100]]

In [15]:
pd.cut(df['Points'], bins=[0, 50, 100], labels=['Fail', 'Pass'])

0    Fail
1    Pass
2    Pass
3    Fail
4    Pass
5    Pass
Name: Points, dtype: category
Categories (2, object): ['Fail' < 'Pass']